In [ ]:
import pandas as pd
import os
from google.colab import drive

In [ ]:
pd.set_option('display.max_columns', None)
# display.[max_categories, max_columns, max_colwidth, max_dir_items,
#   max_info_columns, max_info_rows, max_rows, max_seq_items, memory_usage,
#   min_rows, multi_sparse, notebook_repr_html, pprint_nest_depth, precision,
#   show_dimensions]

In [ ]:
# 나의 구글 드라이브 연결
drive.mount("/content/drive")

Mounted at /content/drive

In [ ]:
path = './drive/MyDrive/Colab Notebooks/'

# 데이터 불러오기

In [ ]:
# 산림체험 관심인구 정보
df1 = pd.read_csv(path + "FPL060101.csv")
# 산림체험 관심인구 선호 산림체험장소 검색 정보
df2 = pd.read_csv(path + "FPL060201.csv")
# 산림체험 관심인구 선호 산림체험 프로그램 검색 정보
df3 = pd.read_csv(path + "FPL060301.csv")

# 산림치유 관심인구 라이프스타일 (온라인쇼핑몰 검색/구매 카테고리) 정보
df4 = pd.read_csv(path + "FPL060501.csv")

# 귀산촌 관심인구 정보
df5 = pd.read_csv(path + "FPL070101.csv")

# 산림재해 관심인구 정보
df19 = pd.read_csv(path + "FPL080101.csv")
# 산림대피소 관심인구 정보
df20 = pd.read_csv(path + "FPL080201.csv")
# 산림재해 관심인구 관심지역 검색정보
df21 = pd.read_csv(path + "FPL080301.csv")
# 산림재해 연관 검색 키워드를 검색한 관심인구 정보
df22 = pd.read_csv(path + "FPL080401.csv")

# 전국 국립공원 등산로 이용자 분류(성/연령)별 평균 칼로리 소모량 정보
df23 = pd.read_csv(path + "PARK_KCAL.csv")

# 산림체험

### df1 : 산림체험 관심인구 정보 (Total : 9,966)

|순위| 1 | 2 | 3 | 4 | 5 |
|--|--|--|--|--|--|
|거주지 230 | 서울 | 경기 | 인천 | 부산 | 대구
|체험 | 숲체험 | 산림복합체험 | 산림체험 |  |
|거주지 20 | 서울 | 경기 | 대구 | 인천 | 부산
|체험 | 숲체험 | 산림복합체험 | 산림체험 |  |
|거주지 30 | 서울 | 경기 | 인천 | 부산 | 대구
|체험 | 숲체험 | 산림복합체험 | 산림체험 |  |
|||||||
|거주지 450 | 서울 | 경기 | 인천 | 부산 | 대구
|체험 | 숲체험 | 산림복합체험 | 산림체험 |  |

`[2-30] 여 : 5,141(86.3%), 남 : 815(13.7%)`

|Age|관심인구|Car|job|
|--|--|--|--|
|2-30|5,956(59.8%)|1,634(27.4%)|2,461(41.3%)
|20|1,278(12.8%)|128(2.1%)|288(4.8%)
|30|4,678(46.9%)|1,506(25.3%)|2,173(36.5%)

---

### df2 : 산림체험 관심인구 선호 산림체험장소 검색 정보 (Total : 4,142)

|순위| 1 | 2 | 3 | 4 | 5 |
|--|--|--|--|--|--|
|거주지 230 | 서울 | 경기 | 부산 | 인천 | 경남
|체험 | 숲체험장 | 숲체험원 | 산림복합체험원 | 산림체험원 |
|거주지 20 | 서울 | 경기 | 인천 | 경남 | 부산
|체험 | 숲체험장 | 숲체험원 | 산림복합체험원 | 산림체험원 |
|거주지 30 | 서울 | 경기 | 부산 | 인천 | 대구
|체험 | 숲체험장 | 숲체험원 | 산림체험원 | 산림복합체험원 |
|||||||
|거주지 450 | 서울 | 경기 | 인천 | 부산 | 대구
|체험 | 숲체험장 | 숲체험원 | 산림복합체험원 | 산림체험원 |

`[2-30] 여 : 2,138(86.3%), 남 : 338(13.7%)`

|Age|관심인구|Car|job|
|--|--|--|--|
|2-30|2,476(59.8%)|705(28.5%)|1031(41.6%)
|20|533(12.9%)|49(2.0%) | 102(4.1%)
|30|1,943(46.9%)|656(26.5%)|929(37.5%)

---

### df3 : 산림체험 관심인구 선호 산림체험 프로그램 검색 정보 (Total : 2,507)

|순위| 1 | 2 | 3 | 4 | 5 |
|--|--|--|--|--|--|
|거주지 230 | 서울 | 경기 | 부산 | 인천 | 대구
|체험 | 숲체험프로그램 | 숲체험교육확동 | 산림복합체험프로그램 | 산림체험프로그램 |
|거주지 20 | 경기 | 서울 | 경남 | 대구 | 부산
|체험 | 숲체험프로그램 | 숲체험교육확동 | 산림복합체험프로그램 | 산림체험프로그램 |
|거주지 30 | 서울 | 경기 | 부산 | 인천 | 대구
|체험 | 숲체험프로그램 | 숲체험교육확동 | 산림복합체험프로그램 | 산림체험프로그램 |
|||||||
|거주지 450 | 서울 | 경기 | 인천 | 부산 | 대구
|체험 | 숲체험프로그램 | 숲체험교육확동 | 산림체험프로그램 | 산림복합체험프로그램 |

`[2-30] 여 : 1,288(86.3%), 남 : 205(13.7%)`

|Age|관심인구|Car|job|
|--|--|--|--|
|2-30|1,493(59.6%)|402(26.9%)|608(40.7%)
|20|328(13.1%)|35(2.3%) | 79(5.3%)
|30|1,165(46.5%)|367(24.6%)|529(35.4%)

---

### df4 : 산림치유 관심인구 라이프스타일 (온라인쇼핑몰 검색/구매 카테고리) 정보 (Total : 42,430)

|순위| 1 | 2 | 3 | 4 | 5 |
|--|--|--|--|--|--|
|거주지 230 | 서울 | 경기 | 부산 | 인천 | 대구
|카테고리 | 식품/건강 | 패션의류 | 생활/주방 | 뷰티 | 디지털/가전
|거주지 20 | 서울 | 부산 | 경기 | 인천 | 경남
|카테고리 | 식품/건강 | 패션의류 | 디지털/가전 | 뷰티 | 생활/주방
|거주지 30 | 서울 | 경기 | 부산 | 인천 | 대구
|카테고리 | 식품/건강 | 패션의류 | 생활/주방 | 뷰티 | 패션잡화
|||||||
|거주지 14560 | 서울 | 경기 | 인천 | 부산 | 대구
|카테고리 | 식품/건강 | 패션의류 | 뷰티 | 생활/주방 | 디지털/가전

`[2-30] 여 : 23,059(88.7%), 남 : 2,941(11.3%)`

|Age|관심인구|Car|job|
|--|--|--|--|
|2-30|26,000(61.3%)|8,680(33.4%)|11,018(42.4%)
|20|5,458(12.9%)|438(1.7%) | 1952(7.5%)
|30|20,542(48.4%)|8,242(31.7%)|9,066(34.9%)

---

### df5 : 귀산촌 관심인구 정보 (Total : 13,011)

|순위| 1 | 2 | 3 | 4 | 5 |
|--|--|--|--|--|--|
|거주지 230 | 서울 | 경기 | 인천 | 부산 | 대구
|귀산촌 | 귀산촌 |  |  |  |
|거주지 20 | 서울 | 경기 | 인천 | 부산 | 경남
|귀산촌 | 귀산촌 |  |  |  |
|거주지 30 | 서울 | 경기 | 인천 | 부산 | 대구
|귀산촌 | 귀산촌 |  |  |  |
|||||||
|거주지 450 | 서울 | 경기 | 인천 | 부산 | 대구
|귀산촌 | 귀산촌 |  |  |  |

`[2-30] 여 : 429(25.6%), 남 : 1,247(74.4%)`

|Age|관심인구|Car|job|
|--|--|--|--|
|2-30|1,676(12.9%)|393(23.4%)|590(35.2%)
|20|741(5.7%)|57(3.4%) | 121(7.2%)
|30|935(7.2%)|336(20.0%)|469(28.0%)

귀산 -> 남자  
산림 체험 및 산림 치유 -> 여자

---
---
# df1 : 산림체험 관심인구 정보 (Total : 9,966)

In [ ]:
len(df1)

9966

In [ ]:
df1.head()

,체험,사이트제목,성별,연령,직업,소득,결혼,자녀,주거,시도,구,동,자동차
0,산림복합체험,유명산 산림복합체험센터,F,3,"사무직 (일반사무직, 공무원, 직업군인)",800~899만원,예,자녀 있음,아파트/ 주상복합,서울,송파구,문정1동,"대형차 (제너시스, BMW5급 등)"
1,숲체험,<지리산 자연휴양림> 숲체험,F,4,NaN,NaN,,,NaN,대전,대덕구,비래동,NaN
2,산림복합체험,유명산 산림복합체험센터,F,3,"사무직 (일반사무직, 공무원, 직업군인)",900~999만원,예,자녀 있음,아파트/ 주상복합,서울,영등포구,여의도동,"중형차 (쏘나타, K5, 말리부, 골프급 등)"
3,산림체험,"카니발 타고 산림 체험 기아차, 산림청과 교통약자 여행 지원",F,3,NaN,NaN,,,NaN,서울,은평구,응암동,NaN
4,숲체험,"봄날에 딱 숲체험,체험놀이<숲속곰디 체험학교>",F,4,"주부 (전업주부, 파트타임 근무 주부)",500~599만원,예,자녀 있음,아파트/ 주상복합,서울,강동구,천호동,"경차 (모닝, 스파크 등)"

In [ ]:
age_counts = df1['연령'].value_counts()
age_counts

3    4678
4    3051
2    1278
5     959
Name: 연령, dtype: int64

In [ ]:
age_counts.loc[[2,3]].sum(), round(age_counts.loc[[2,3]].sum() / age_counts.sum() * 100, 1),\
round(age_counts.loc[2] / age_counts.sum() * 100, 1),\
round(age_counts.loc[3] / age_counts.sum() * 100, 1),\
round(age_counts.drop([2,3]).sum() / age_counts.sum() * 100, 1)

(5956, 59.8, 12.8, 46.9, 40.2)

In [ ]:
df1_23 = df1[df1['연령'].isin([2, 3])]
df1_2 = df1[(df1['연령'] == 2)]
df1_3 = df1[(df1['연령'] == 3)]
df1_1456 = df1[df1['연령'].isin([1, 4, 5, 6])]

In [ ]:
df1_23.head()

,체험,사이트제목,성별,연령,직업,소득,결혼,자녀,주거,시도,구,동,자동차
0,산림복합체험,유명산 산림복합체험센터,F,3,"사무직 (일반사무직, 공무원, 직업군인)",800~899만원,예,자녀 있음,아파트/ 주상복합,서울,송파구,문정1동,"대형차 (제너시스, BMW5급 등)"
2,산림복합체험,유명산 산림복합체험센터,F,3,"사무직 (일반사무직, 공무원, 직업군인)",900~999만원,예,자녀 있음,아파트/ 주상복합,서울,영등포구,여의도동,"중형차 (쏘나타, K5, 말리부, 골프급 등)"
3,산림체험,"카니발 타고 산림 체험 기아차, 산림청과 교통약자 여행 지원",F,3,NaN,NaN,,,NaN,서울,은평구,응암동,NaN
5,숲체험,서울대공원 숲체험,F,2,NaN,NaN,,,NaN,경기,부천시 원미구,상동,NaN
6,숲체험,"봄날에 딱 숲체험,체험놀이<숲속곰디 체험학교>",F,3,"사무직 (일반사무직, 공무원, 직업군인)","1,000만원 이상",아니오,,아파트/ 주상복합,경기,용인시 수지구,죽전1동,"중형차 (쏘나타, K5, 말리부, 골프급 등)"

### 230대 성별

In [ ]:
sex_counts = df1_23['성별'].value_counts()
sex_counts

F    5141
M     815
Name: 성별, dtype: int64

In [ ]:
round(sex_counts.loc['F'] / sex_counts.sum() * 100 , 1),\
round(sex_counts.loc['M'] / sex_counts.sum() * 100 , 1)

(86.3, 13.7)

### 230대 직업

In [ ]:
df1_23['직업'].notnull().sum(), df1_23['소득'].notnull().sum()

(3846, 3842)

In [ ]:
job_counts = df1_23['직업'].value_counts()
job_counts

사무직 (일반사무직, 공무원, 직업군인)             1303
주부 (전업주부, 파트타임 근무 주부)               878
전문직 (의사, 판검사, 예술가, 종교인)             365
학생 (초중고학생, 대학생, 대학원생)               292
교직 (교사, 유치원교사, 학원강사)                257
무직                                  205
서비스직 (요식업, 숙박업, 미용실종업원)             145
기타                                  130
자영업 (도소매업, 숙박업, 미용업)                 87
판매직 (상점점원, 보험설계사, 노점상)               72
생산/노무직 (생산감독, 경비원, 공장근로자)            53
기능직 (자동차정비, 운전기사, 안경사, 택시기사)         28
관리직 (사장, 간부, 고위공무원)                  18
퇴직/연금생활자                             10
농/축/광/수산업 (축산, 낙농업, 수산, 임업, 광업)       3
Name: 직업, dtype: int64

In [ ]:
drop_jobs = job_counts[job_counts.index.str.contains('학생|퇴직|주부')]
drop_jobs

주부 (전업주부, 파트타임 근무 주부)    878
학생 (초중고학생, 대학생, 대학원생)    292
퇴직/연금생활자                  10
Name: 직업, dtype: int64

In [ ]:
round((job_counts.sum() - drop_jobs.sum() - job_counts['무직']) / len(df1_23) * 100, 1),\
job_counts.sum() - drop_jobs.sum() - job_counts['무직']

(41.3, 2461)

In [ ]:
job2_counts = df1_2['직업'].value_counts()
job3_counts = df1_3['직업'].value_counts()

In [ ]:
drop2_jobs = job2_counts[job2_counts.index.str.contains('학생|퇴직|주부')]
drop3_jobs = job3_counts[job3_counts.index.str.contains('학생|퇴직|주부')]
drop3_jobs

주부 (전업주부, 파트타임 근무 주부)    845
학생 (초중고학생, 대학생, 대학원생)     31
퇴직/연금생활자                   6
Name: 직업, dtype: int64

In [ ]:
round((job2_counts.sum() - drop2_jobs.sum() - job2_counts['무직']) / len(df1_23) * 100, 1),\
job2_counts.sum() - drop2_jobs.sum() - job2_counts['무직'],\
round((job3_counts.sum() - drop3_jobs.sum() - job3_counts['무직']) / len(df1_23) * 100, 1),\
job3_counts.sum() - drop3_jobs.sum() - job3_counts['무직']

(4.8, 288, 36.5, 2173)

### 230대 자동차

In [ ]:
car_counts = df1_23['자동차'].value_counts()
car_counts

준중형차 (아반떼, K3, 크루즈, 제타급 등)          420
경차 (모닝, 스파크 등)                      314
중형차 (쏘나타, K5, 말리부, 골프급 등)           282
중형SUV (싼타페, 쏘렌토, 캡티바, BMW X3급 등)    144
준중형SUV (투싼, 스포티지, QM5, 티구안급 등)      112
준대형차 (그랜저, K7, 알페온, 캠리급, 파사트급 등)    102
소형차 (액센트, 프라이드, 아베오, 피아트급 등)        102
대형차 (제너시스, BMW5급 등)                  40
소형SUV/CUV (티볼리, QM3 등)               40
MPV (카니발, 올란도, 피카소급, 오딧세이 등)         29
대형SUV (베라크루즈, 모하비, 투아렉급 등)           27
기타 (승합차/트럭/화물차/기타 차량 등)               9
준중형파생 (벨로스터, I30 등)                   7
스포츠 (제네시스 쿠페, BMW M, 벤츠 AMG 등)        4
프리미엄 (에쿠스, BMW7급 등)                   2
Name: 자동차, dtype: int64

In [ ]:
round(car_counts.sum() / len(df1_23) * 100, 1),\
car_counts.sum()

(27.4, 1634)

In [ ]:
car2_counts = df1_2['자동차'].value_counts()
car3_counts = df1_3['자동차'].value_counts()

round(car2_counts.sum() / len(df1_23) * 100, 1),\
car2_counts.sum(),\
round(car3_counts.sum() / len(df1_23) * 100, 1),\
car3_counts.sum()

(2.1, 128, 25.3, 1506)

In [ ]:
df1_23['시도'].value_counts()[:5],\
df1_2['시도'].value_counts()[:5],\
df1_3['시도'].value_counts()[:5]

(서울    2089
 경기    1534
 인천     346
 부산     326
 대구     268
 Name: 시도, dtype: int64,
 서울    391
 경기    328
 대구     70
 인천     69
 부산     65
 Name: 시도, dtype: int64,
 서울    1698
 경기    1206
 인천     277
 부산     261
 대구     198
 Name: 시도, dtype: int64)

In [ ]:
df1_23[df1_23['시도'] == "서울"]['체험'].value_counts()[:6],\
df1_2[df1_2['시도'] == "서울"]['체험'].value_counts()[:6],\
df1_3[df1_3['시도'] == "서울"]['체험'].value_counts()[:6]

(숲체험       1035
 산림복합체험     547
 산림체험       507
 Name: 체험, dtype: int64,
 숲체험       193
 산림복합체험    102
 산림체험       96
 Name: 체험, dtype: int64,
 숲체험       842
 산림복합체험    445
 산림체험      411
 Name: 체험, dtype: int64)

In [ ]:
df1_1456['시도'].value_counts()[:5],\
df1_1456[df1_1456['시도'] == "서울"]['체험'].value_counts()[:6]

(서울    1344
 경기    1069
 인천     247
 부산     223
 대구     160
 Name: 시도, dtype: int64,
 숲체험       644
 산림복합체험    355
 산림체험      345
 Name: 체험, dtype: int64)

# df2 : 산림체험 관심인구 선호 산림체험장소 검색 정보 (Total : 4,142)

In [ ]:
len(df2)

4142

In [ ]:
df2.head()

,체험,사이트제목,성별,연령,직업,소득,결혼,자녀,주거,시도,구,동,자동차
0,숲체험원,김포시 유아 숲체험원/아이와 주말에 하는 체험학습-유아숲지도사와 5월의 가족숲체험!...,F,3,NaN,NaN,,,NaN,서울,용산구,한남동,NaN
1,숲체험장,베짱이 유아 숲체험장,F,3,"사무직 (일반사무직, 공무원, 직업군인)",600~699만원,아니오,,아파트/ 주상복합,인천,부평구,산곡4동,NaN
2,숲체험장,[시흥시]조남숲체험장과 유아숲체험장,F,3,"주부 (전업주부, 파트타임 근무 주부)",500~599만원,예,자녀 있음,아파트/ 주상복합,경기,김포시,장기동,NaN
3,숲체험원,김포시 유아 숲체험원/아이와 주말에 하는 체험학습-유아숲지도사와 5월의 가족숲체험!...,F,3,"사무직 (일반사무직, 공무원, 직업군인)",200~299만원,예,자녀 있음,아파트/ 주상복합,부산,북구,금곡동,"경차 (모닝, 스파크 등)"
4,숲체험장,일상_ 1박2일 명상여행(feat 강원 숲 체험장),F,3,"사무직 (일반사무직, 공무원, 직업군인)",200~299만원,예,자녀 없음,아파트/ 주상복합,서울,성북구,길음동,NaN

### 연령

In [ ]:
age_counts = df2['연령'].value_counts()
age_counts

3    1943
4    1266
2     533
5     400
Name: 연령, dtype: int64

In [ ]:
age_counts.loc[[2,3]].sum(), round(age_counts.loc[[2,3]].sum() / age_counts.sum() * 100, 1),\
age_counts.loc[2], round(age_counts.loc[2] / age_counts.sum() * 100, 1),\
age_counts.loc[3], round(age_counts.loc[3] / age_counts.sum() * 100, 1),\
age_counts.drop([2,3]).sum(), round(age_counts.drop([2,3]).sum() / age_counts.sum() * 100, 1)

(2476, 59.8, 533, 12.9, 1943, 46.9, 1666, 40.2)

In [ ]:
df2_23 = df2[df2['연령'].isin([2, 3])]
df2_2 = df2[(df2['연령'] == 2)]
df2_3 = df2[(df2['연령'] == 3)]
df2_1456 = df2[df2['연령'].isin([1, 4, 5, 6])]

### 230대 성별

In [ ]:
sex_counts = df2_23['성별'].value_counts()
sex_counts

F    2138
M     338
Name: 성별, dtype: int64

In [ ]:
round(sex_counts.loc['F'] / sex_counts.sum() * 100 , 1),\
round(sex_counts.loc['M'] / sex_counts.sum() * 100 , 1)

(86.3, 13.7)

### 230대 직업

In [ ]:
job_counts = df2_23['직업'].value_counts()
job_counts

사무직 (일반사무직, 공무원, 직업군인)             553
주부 (전업주부, 파트타임 근무 주부)              355
전문직 (의사, 판검사, 예술가, 종교인)            166
학생 (초중고학생, 대학생, 대학원생)              116
교직 (교사, 유치원교사, 학원강사)                94
무직                                  80
서비스직 (요식업, 숙박업, 미용실종업원)             58
기타                                  52
자영업 (도소매업, 숙박업, 미용업)                35
판매직 (상점점원, 보험설계사, 노점상)              35
생산/노무직 (생산감독, 경비원, 공장근로자)           16
기능직 (자동차정비, 운전기사, 안경사, 택시기사)        11
관리직 (사장, 간부, 고위공무원)                 10
퇴직/연금생활자                             8
농/축/광/수산업 (축산, 낙농업, 수산, 임업, 광업)      1
Name: 직업, dtype: int64

In [ ]:
drop_jobs = job_counts[job_counts.index.str.contains('학생|퇴직|주부')]
drop_jobs

주부 (전업주부, 파트타임 근무 주부)    355
학생 (초중고학생, 대학생, 대학원생)    116
퇴직/연금생활자                   8
Name: 직업, dtype: int64

In [ ]:
round((job_counts.sum() - drop_jobs.sum() - job_counts['무직']) / len(df2_23) * 100, 1),\
job_counts.sum() - drop_jobs.sum() - job_counts['무직']

(41.6, 1031)

In [ ]:
job2_counts = df2_2['직업'].value_counts()
job3_counts = df2_3['직업'].value_counts()

In [ ]:
drop2_jobs = job2_counts[job2_counts.index.str.contains('학생|퇴직|주부')]
drop3_jobs = job3_counts[job3_counts.index.str.contains('학생|퇴직|주부')]

In [ ]:
round((job2_counts.sum() - drop2_jobs.sum() - job2_counts['무직']) / len(df2_23) * 100, 1),\
job2_counts.sum() - drop2_jobs.sum() - job2_counts['무직'],\
round((job3_counts.sum() - drop3_jobs.sum() - job3_counts['무직']) / len(df2_23) * 100, 1),\
job3_counts.sum() - drop3_jobs.sum() - job3_counts['무직']

(4.1, 102, 37.5, 929)

### 230대 자동차

In [ ]:
car_counts = df2_23['자동차'].value_counts()
car_counts

준중형차 (아반떼, K3, 크루즈, 제타급 등)          182
경차 (모닝, 스파크 등)                      133
중형차 (쏘나타, K5, 말리부, 골프급 등)           125
중형SUV (싼타페, 쏘렌토, 캡티바, BMW X3급 등)     62
준대형차 (그랜저, K7, 알페온, 캠리급, 파사트급 등)     49
준중형SUV (투싼, 스포티지, QM5, 티구안급 등)       46
소형차 (액센트, 프라이드, 아베오, 피아트급 등)         45
MPV (카니발, 올란도, 피카소급, 오딧세이 등)         19
소형SUV/CUV (티볼리, QM3 등)               12
대형SUV (베라크루즈, 모하비, 투아렉급 등)           11
대형차 (제너시스, BMW5급 등)                   9
기타 (승합차/트럭/화물차/기타 차량 등)               7
프리미엄 (에쿠스, BMW7급 등)                   2
스포츠 (제네시스 쿠페, BMW M, 벤츠 AMG 등)        2
준중형파생 (벨로스터, I30 등)                   1
Name: 자동차, dtype: int64

In [ ]:
round(car_counts.sum() / len(df2_23) * 100, 1),\
car_counts.sum()

(28.5, 705)

In [ ]:
car2_counts = df2_2['자동차'].value_counts()
car3_counts = df2_3['자동차'].value_counts()

round(car2_counts.sum() / len(df2_23) * 100, 1),\
car2_counts.sum(),\
round(car3_counts.sum() / len(df2_23) * 100, 1),\
car3_counts.sum()

(2.0, 49, 26.5, 656)

### 230대 거주지

In [ ]:
df2_23['시도'].value_counts()[:5],\
df2_2['시도'].value_counts()[:5],\
df2_3['시도'].value_counts()[:5]

(서울    882
 경기    623
 부산    156
 인천    145
 경남     93
 Name: 시도, dtype: int64,
 서울    166
 경기    132
 인천     39
 경남     38
 부산     33
 Name: 시도, dtype: int64,
 서울    716
 경기    491
 부산    123
 인천    106
 대구     71
 Name: 시도, dtype: int64)

In [ ]:
df2_23[df2_23['시도'] == "서울"]['체험'].value_counts()[:5],\
df2_2[df2_2['시도'] == "서울"]['체험'].value_counts()[:5],\
df2_3[df2_3['시도'] == "서울"]['체험'].value_counts()[:5]

(숲체험장       448
 숲체험원       282
 산림복합체험원     79
 산림체험원       73
 Name: 체험, dtype: int64,
 숲체험장       85
 숲체험원       46
 산림복합체험원    23
 산림체험원      12
 Name: 체험, dtype: int64,
 숲체험장       363
 숲체험원       236
 산림체험원       61
 산림복합체험원     56
 Name: 체험, dtype: int64)

In [ ]:
df2_1456['시도'].value_counts()[:5],\
df2_1456[df2_1456['시도'] == "서울"]['체험'].value_counts()[:5]

(서울    590
 경기    449
 인천     93
 부산     84
 대구     58
 Name: 시도, dtype: int64,
 숲체험장       298
 숲체험원       171
 산림복합체험원     62
 산림체험원       59
 Name: 체험, dtype: int64)

# df3 : 산림체험 관심인구 선호 산림체험 프로그램 검색 정보 (Total : 2507)

In [ ]:
len(df3)

2507

In [ ]:
df3.head()

,체험,사이트제목,성별,연령,직업,소득,결혼,자녀,주거,시도,구,동,자동차
0,산림체험프로그램,장령산자연휴양림치유의숲산림치유염색체험프로그램안내,F,3,"주부 (전업주부, 파트타임 근무 주부)",500~599만원,예,자녀 있음,아파트/ 주상복합,경기,김포시,장기동,NaN
1,숲체험프로그램,"함허동천,숲체험프로그램",F,4,NaN,NaN,,,NaN,서울,은평구,응암동,NaN
2,숲체험프로그램,초등딸1학기트레킹숲체험프로그램을마쳤어요,F,3,NaN,NaN,,,NaN,서울,강서구,가양1동,NaN
3,숲체험교육확동,작은손마켓놀이숲체험유치원즐거워요,F,4,"사무직 (일반사무직, 공무원, 직업군인)",300~399만원,아니오,,아파트/ 주상복합,서울,송파구,문정2동,NaN
4,숲체험교육확동,[봉화]힐빙스테이4기/봉화가족체험프로그램/봉화춘양목숲힐빙프로그램/봉화가족캠프/춘양목...,M,3,NaN,NaN,,,NaN,광주,광산구,신가동,NaN

### AGE

In [ ]:
age_counts = df3['연령'].value_counts()
age_counts

3    1165
4     770
2     328
5     244
Name: 연령, dtype: int64

In [ ]:
age_counts.loc[[2,3]].sum(), round(age_counts.loc[[2,3]].sum() / age_counts.sum() * 100, 1),\
age_counts.loc[2], round(age_counts.loc[2] / age_counts.sum() * 100, 1),\
age_counts.loc[3], round(age_counts.loc[3] / age_counts.sum() * 100, 1),\
age_counts.drop([2,3]).sum(), round(age_counts.drop([2,3]).sum() / age_counts.sum() * 100, 1)

(1493, 59.6, 328, 13.1, 1165, 46.5, 1014, 40.4)

In [ ]:
df3_23 = df3[df3['연령'].isin([2, 3])]
df3_2 = df3[(df3['연령'] == 2)]
df3_3 = df3[(df3['연령'] == 3)]
df3_1456 = df3[df3['연령'].isin([1, 4, 5, 6])]

### 230대 성별

In [ ]:
sex_counts = df3_23['성별'].value_counts()
sex_counts

F    1288
M     205
Name: 성별, dtype: int64

In [ ]:
round(sex_counts.loc['F'] / sex_counts.sum() * 100 , 1),\
round(sex_counts.loc['M'] / sex_counts.sum() * 100 , 1)

(86.3, 13.7)

### 230대 직업

In [ ]:
job_counts = df3_23['직업'].value_counts()
job_counts

사무직 (일반사무직, 공무원, 직업군인)             331
주부 (전업주부, 파트타임 근무 주부)              217
전문직 (의사, 판검사, 예술가, 종교인)             92
학생 (초중고학생, 대학생, 대학원생)               70
교직 (교사, 유치원교사, 학원강사)                62
무직                                  44
서비스직 (요식업, 숙박업, 미용실종업원)             35
기타                                  32
판매직 (상점점원, 보험설계사, 노점상)              14
자영업 (도소매업, 숙박업, 미용업)                12
생산/노무직 (생산감독, 경비원, 공장근로자)           11
관리직 (사장, 간부, 고위공무원)                  9
기능직 (자동차정비, 운전기사, 안경사, 택시기사)         6
농/축/광/수산업 (축산, 낙농업, 수산, 임업, 광업)      4
퇴직/연금생활자                             3
Name: 직업, dtype: int64

In [ ]:
drop_jobs = job_counts[job_counts.index.str.contains('학생|퇴직|주부')]
drop_jobs

주부 (전업주부, 파트타임 근무 주부)    217
학생 (초중고학생, 대학생, 대학원생)     70
퇴직/연금생활자                   3
Name: 직업, dtype: int64

In [ ]:
round((job_counts.sum() - drop_jobs.sum() - job_counts['무직']) / len(df3_23) * 100, 1),\
job_counts.sum() - drop_jobs.sum() - job_counts['무직']

(40.7, 608)

In [ ]:
job2_counts = df3_2['직업'].value_counts()
job3_counts = df3_3['직업'].value_counts()

In [ ]:
drop2_jobs = job2_counts[job2_counts.index.str.contains('학생|퇴직|주부')]
drop3_jobs = job3_counts[job3_counts.index.str.contains('학생|퇴직|주부')]

In [ ]:
round((job2_counts.sum() - drop2_jobs.sum() - job2_counts['무직']) / len(df3_23) * 100, 1),\
job2_counts.sum() - drop2_jobs.sum() - job2_counts['무직'],\
round((job3_counts.sum() - drop3_jobs.sum() - job3_counts['무직']) / len(df3_23) * 100, 1),\
job3_counts.sum() - drop3_jobs.sum() - job3_counts['무직']

(5.3, 79, 35.4, 529)

### 230대 자동차

In [ ]:
car_counts = df3_23['자동차'].value_counts()
car_counts

준중형차 (아반떼, K3, 크루즈, 제타급 등)          114
경차 (모닝, 스파크 등)                       80
중형차 (쏘나타, K5, 말리부, 골프급 등)            71
중형SUV (싼타페, 쏘렌토, 캡티바, BMW X3급 등)     40
준중형SUV (투싼, 스포티지, QM5, 티구안급 등)       27
소형차 (액센트, 프라이드, 아베오, 피아트급 등)         24
준대형차 (그랜저, K7, 알페온, 캠리급, 파사트급 등)     18
대형차 (제너시스, BMW5급 등)                  10
MPV (카니발, 올란도, 피카소급, 오딧세이 등)          4
기타 (승합차/트럭/화물차/기타 차량 등)               4
소형SUV/CUV (티볼리, QM3 등)                4
대형SUV (베라크루즈, 모하비, 투아렉급 등)            4
준중형파생 (벨로스터, I30 등)                   1
스포츠 (제네시스 쿠페, BMW M, 벤츠 AMG 등)        1
Name: 자동차, dtype: int64

In [ ]:
round(car_counts.sum() / len(df3_23) * 100, 1),\
car_counts.sum()

(26.9, 402)

In [ ]:
car2_counts = df3_2['자동차'].value_counts()
car3_counts = df3_3['자동차'].value_counts()

round(car2_counts.sum() / len(df3_23) * 100, 1),\
car2_counts.sum(),\
round(car3_counts.sum() / len(df3_23) * 100, 1),\
car3_counts.sum()

(2.3, 35, 24.6, 367)

### 230대 거주지

In [ ]:
df3_23['시도'].value_counts()[:5],\
df3_2['시도'].value_counts()[:5],\
df3_3['시도'].value_counts()[:5]

(서울    512
 경기    400
 부산     72
 인천     68
 대구     67
 Name: 시도, dtype: int64,
 경기    97
 서울    92
 경남    18
 대구    16
 부산    14
 Name: 시도, dtype: int64,
 서울    420
 경기    303
 부산     58
 인천     57
 대구     51
 Name: 시도, dtype: int64)

In [ ]:
df3_23[df3_23['시도'] == "서울"]['체험'].value_counts()[:5],\
df3_2[df3_2['시도'] == "경기"]['체험'].value_counts()[:5],\
df3_3[df3_3['시도'] == "서울"]['체험'].value_counts()[:5]

(숲체험프로그램       210
 숲체험교육확동       194
 산림복합체험프로그램     58
 산림체험프로그램       50
 Name: 체험, dtype: int64,
 숲체험프로그램       46
 숲체험교육확동       34
 산림복합체험프로그램    10
 산림체험프로그램       7
 Name: 체험, dtype: int64,
 숲체험프로그램       168
 숲체험교육확동       161
 산림복합체험프로그램     49
 산림체험프로그램       42
 Name: 체험, dtype: int64)

In [ ]:
df3_1456['시도'].value_counts()[:5],\
df3_1456[df3_1456['시도'] == "서울"]['체험'].value_counts()[:5]

(서울    363
 경기    257
 인천     54
 부산     53
 대구     46
 Name: 시도, dtype: int64,
 숲체험프로그램       162
 숲체험교육확동       132
 산림체험프로그램       40
 산림복합체험프로그램     29
 Name: 체험, dtype: int64)

# df4 : 산림치유 관심인구 라이프스타일 (온라인쇼핑몰 검색/구매 카테고리) 정보 (Total : 42,430)

In [ ]:
len(df4)

42430

In [ ]:
df4.head()

,카테고리,성별,연령,직업,소득,결혼,자녀,주거,시도,구,동,자동차
0,패션잡화,F,4,NaN,NaN,,,NaN,서울,은평구,응암동,NaN
1,패션잡화,F,4,NaN,NaN,,,NaN,서울,은평구,응암동,NaN
2,뷰티,F,3,"사무직 (일반사무직, 공무원, 직업군인)",200~299만원,예,자녀 없음,아파트/ 주상복합,서울,성북구,길음동,NaN
3,식품/건강,F,3,"주부 (전업주부, 파트타임 근무 주부)",200~299만원,예,자녀 있음,단독주택,부산,해운대구,재송1동,"소형차 (액센트, 프라이드, 아베오, 피아트급 등)"
4,패션의류,F,3,NaN,NaN,,,NaN,대구,북구,검단동,NaN

In [ ]:
age_counts = df4['연령'].value_counts()
age_counts

3    20542
4    12242
2     5458
5     4188
Name: 연령, dtype: int64

In [ ]:
age_counts.loc[[2,3]].sum(), round(age_counts.loc[[2,3]].sum() / age_counts.sum() * 100, 1),\
round(age_counts.loc[2] / age_counts.sum() * 100, 1),\
round(age_counts.loc[3] / age_counts.sum() * 100, 1),\
round(age_counts.drop([2,3]).sum() / age_counts.sum() * 100, 1)

(26000, 61.3, 12.9, 48.4, 38.7)

In [ ]:
df4_23 = df4[df4['연령'].isin([2, 3])]
df4_2 = df4[(df4['연령'] == 2)]
df4_3 = df4[(df4['연령'] == 3)]
df4_45 = df4[df4['연령'].isin([4, 5])]

In [ ]:
df4_23.head()

,카테고리,성별,연령,직업,소득,결혼,자녀,주거,시도,구,동,자동차
2,뷰티,F,3,"사무직 (일반사무직, 공무원, 직업군인)",200~299만원,예,자녀 없음,아파트/ 주상복합,서울,성북구,길음동,NaN
3,식품/건강,F,3,"주부 (전업주부, 파트타임 근무 주부)",200~299만원,예,자녀 있음,단독주택,부산,해운대구,재송1동,"소형차 (액센트, 프라이드, 아베오, 피아트급 등)"
4,패션의류,F,3,NaN,NaN,,,NaN,대구,북구,검단동,NaN
5,패션의류,F,3,NaN,NaN,,,NaN,대구,북구,검단동,NaN
8,디지털/가전,F,2,NaN,NaN,,,NaN,서울,서대문구,충정로3가,NaN

### 230대 성별

In [ ]:
sex_counts = df4_23['성별'].value_counts()
sex_counts

F    23059
M     2941
Name: 성별, dtype: int64

In [ ]:
round(sex_counts.loc['F'] / sex_counts.sum() * 100 , 1),\
round(sex_counts.loc['M'] / sex_counts.sum() * 100 , 1)

(88.7, 11.3)

### 230대 직업

In [ ]:
df4_23['직업'].notnull().sum(), df4_23['소득'].notnull().sum()

(18712, 18701)

In [ ]:
job_counts = df4_23['직업'].value_counts()
job_counts

사무직 (일반사무직, 공무원, 직업군인)             6332
주부 (전업주부, 파트타임 근무 주부)              5613
전문직 (의사, 판검사, 예술가, 종교인)            1313
교직 (교사, 유치원교사, 학원강사)               1077
무직                                 1029
학생 (초중고학생, 대학생, 대학원생)              1011
서비스직 (요식업, 숙박업, 미용실종업원)             534
판매직 (상점점원, 보험설계사, 노점상)              532
기타                                  462
자영업 (도소매업, 숙박업, 미용업)                292
생산/노무직 (생산감독, 경비원, 공장근로자)           194
기능직 (자동차정비, 운전기사, 안경사, 택시기사)        182
관리직 (사장, 간부, 고위공무원)                  85
퇴직/연금생활자                             41
농/축/광/수산업 (축산, 낙농업, 수산, 임업, 광업)      15
Name: 직업, dtype: int64

In [ ]:
drop_jobs = job_counts[job_counts.index.str.contains('학생|퇴직|주부')]
drop_jobs

주부 (전업주부, 파트타임 근무 주부)    5613
학생 (초중고학생, 대학생, 대학원생)    1011
퇴직/연금생활자                   41
Name: 직업, dtype: int64

In [ ]:
round((job_counts.sum() - drop_jobs.sum() - job_counts['무직']) / len(df4_23) * 100, 1),\
job_counts.sum() - drop_jobs.sum() - job_counts['무직']

(42.4, 11018)

In [ ]:
job2_counts = df4_2['직업'].value_counts()
job3_counts = df4_3['직업'].value_counts()

In [ ]:
drop2_jobs = job2_counts[job2_counts.index.str.contains('학생|퇴직|주부')]
drop3_jobs = job3_counts[job3_counts.index.str.contains('학생|퇴직|주부')]
drop3_jobs

주부 (전업주부, 파트타임 근무 주부)    5517
학생 (초중고학생, 대학생, 대학원생)     117
퇴직/연금생활자                   24
Name: 직업, dtype: int64

In [ ]:
round((job2_counts.sum() - drop2_jobs.sum() - job2_counts['무직']) / len(df4_23) * 100, 1),\
job2_counts.sum() - drop2_jobs.sum() - job2_counts['무직'],\
round((job3_counts.sum() - drop3_jobs.sum() - job3_counts['무직']) / len(df4_23) * 100, 1),\
job3_counts.sum() - drop3_jobs.sum() - job3_counts['무직']

(7.5, 1952, 34.9, 9066)

### 230대 자동차

In [ ]:
car_counts = df4_23['자동차'].value_counts()
car_counts

준중형차 (아반떼, K3, 크루즈, 제타급 등)          1840
경차 (모닝, 스파크 등)                      1483
소형SUV/CUV (티볼리, QM3 등)              1363
중형차 (쏘나타, K5, 말리부, 골프급 등)           1084
준대형차 (그랜저, K7, 알페온, 캠리급, 파사트급 등)     686
중형SUV (싼타페, 쏘렌토, 캡티바, BMW X3급 등)     550
MPV (카니발, 올란도, 피카소급, 오딧세이 등)         533
준중형SUV (투싼, 스포티지, QM5, 티구안급 등)       521
소형차 (액센트, 프라이드, 아베오, 피아트급 등)         311
대형차 (제너시스, BMW5급 등)                  145
대형SUV (베라크루즈, 모하비, 투아렉급 등)            76
준중형파생 (벨로스터, I30 등)                   29
기타 (승합차/트럭/화물차/기타 차량 등)               23
스포츠 (제네시스 쿠페, BMW M, 벤츠 AMG 등)        22
프리미엄 (에쿠스, BMW7급 등)                   14
Name: 자동차, dtype: int64

In [ ]:
round(car_counts.sum() / len(df4_23) * 100, 1),\
car_counts.sum()

(33.4, 8680)

In [ ]:
car2_counts = df4_2['자동차'].value_counts()
car3_counts = df4_3['자동차'].value_counts()

round(car2_counts.sum() / len(df4_23) * 100, 1),\
car2_counts.sum(),\
round(car3_counts.sum() / len(df4_23) * 100, 1),\
car3_counts.sum()

(1.7, 438, 31.7, 8242)

In [ ]:
df4_23['시도'].value_counts()[:5],\
df4_2['시도'].value_counts()[:5],\
df4_3['시도'].value_counts()[:5]

(서울    8704
 경기    6091
 부산    2720
 인천    1546
 대구    1426
 Name: 시도, dtype: int64,
 서울    1399
 부산    1192
 경기    1144
 인천     253
 경남     225
 Name: 시도, dtype: int64,
 서울    7305
 경기    4947
 부산    1528
 인천    1293
 대구    1205
 Name: 시도, dtype: int64)

In [ ]:
df4_23[df4_23['시도'] == "서울"]['카테고리'].value_counts()[:5],\
df4_2[df4_2['시도'] == "서울"]['카테고리'].value_counts()[:5],\
df4_3[df4_3['시도'] == "서울"]['카테고리'].value_counts()[:5]

(식품/건강     3581
 패션의류      1121
 생활/주방     1015
 뷰티         951
 디지털/가전     829
 Name: 카테고리, dtype: int64,
 식품/건강     488
 패션의류      239
 디지털/가전    187
 뷰티        162
 생활/주방     159
 Name: 카테고리, dtype: int64,
 식품/건강    3093
 패션의류      882
 생활/주방     856
 뷰티        789
 패션잡화      736
 Name: 카테고리, dtype: int64)

In [ ]:
df4_45['시도'].value_counts()[:5],\
df4_45[df4_45['시도'] == "서울"]['카테고리'].value_counts()[:5]

(서울    5489
 경기    5416
 인천     967
 부산     757
 대구     559
 Name: 시도, dtype: int64,
 식품/건강     1961
 패션의류      1331
 뷰티         667
 생활/주방      603
 디지털/가전     449
 Name: 카테고리, dtype: int64)

# df5 : 귀산촌 관심인구 정보 (Total : 13011)

In [ ]:
len(df5)

13011

In [ ]:
df5.head()

,귀산촌,사이트제목,성별,연령,직업,소득,결혼,자녀,주거,시도,구,동,자동차
0,귀산촌,"청년 일자리, 귀농귀산촌 마을공동체에서 길을 찾다 토론회",M,5,NaN,NaN,,,NaN,경기,안산시 상록구,사1동,NaN
1,귀산촌,버섯 재배기술로 성공적인 귀산촌~~,M,2,NaN,NaN,,,NaN,충남,논산시,내동,NaN
2,귀산촌,"[충북뉴스] 괴산군, 장기체류형 귀산촌 핵심지역육성",F,5,NaN,NaN,,,NaN,강원,원주시,단계동,NaN
3,귀산촌,"[충북뉴스] 괴산군, 장기체류형 귀산촌 핵심지역육성",M,5,NaN,NaN,,,NaN,서울,강동구,길동,NaN
4,귀산촌,귀농ㆍ귀산촌시 중요한 소득작물 선택_지리산의 품격 들꽃다물,F,4,"주부 (전업주부, 파트타임 근무 주부)",300~399만원,예,자녀 있음,아파트/ 주상복합,전남,나주시,송월동,"경차 (모닝, 스파크 등)"

In [ ]:
age_counts = df5['연령'].value_counts()
age_counts

5    8162
4    3173
3     935
2     741
Name: 연령, dtype: int64

In [ ]:
age_counts.loc[[2,3]].sum(), round(age_counts.loc[[2,3]].sum() / age_counts.sum() * 100, 1),\
round(age_counts.loc[2] / age_counts.sum() * 100, 1),\
round(age_counts.loc[3] / age_counts.sum() * 100, 1),\
round(age_counts.drop([2,3]).sum() / age_counts.sum() * 100, 1)

(1676, 12.9, 5.7, 7.2, 87.1)

In [ ]:
df5_23 = df5[df5['연령'].isin([2, 3])]
df5_2 = df5[(df5['연령'] == 2)]
df5_3 = df5[(df5['연령'] == 3)]
df5_45 = df5[df5['연령'].isin([4, 5])]

In [ ]:
df5_23.head()

,귀산촌,사이트제목,성별,연령,직업,소득,결혼,자녀,주거,시도,구,동,자동차
1,귀산촌,버섯 재배기술로 성공적인 귀산촌~~,M,2,NaN,NaN,,,NaN,충남,논산시,내동,NaN
12,귀산촌,"밀양 임야 태양광부지or귀산촌 추천2,790평 (평당2만원)",M,2,NaN,NaN,,,NaN,부산,북구,구포동,NaN
17,귀산촌,정선임야 귀산촌 산림경영 산림경영관리사 산채재배 농가주택,M,3,NaN,NaN,,,NaN,인천,남구,학익1동,NaN
27,귀산촌,폐업대추농장에서 사과대추나무 반값에 판매해요! 귀농이나 귀산촌 하시는분들께 추천합니다.,M,3,NaN,NaN,,,NaN,서울,용산구,청파동3가,NaN
35,귀산촌,임야에 산더덕 재배방법/귀산촌 자연농법,M,3,NaN,NaN,,,NaN,인천,중구,항동7가,NaN

### 230대 성별

In [ ]:
sex_counts = df5_23['성별'].value_counts()
sex_counts

M    1247
F     429
Name: 성별, dtype: int64

In [ ]:
round(sex_counts.loc['F'] / sex_counts.sum() * 100 , 1),\
round(sex_counts.loc['M'] / sex_counts.sum() * 100 , 1)

(25.6, 74.4)

### 230대 직업

In [ ]:
df5_23['직업'].notnull().sum(), df5_23['소득'].notnull().sum()

(876, 875)

In [ ]:
job_counts = df5_23['직업'].value_counts()
job_counts

사무직 (일반사무직, 공무원, 직업군인)             279
학생 (초중고학생, 대학생, 대학원생)              164
전문직 (의사, 판검사, 예술가, 종교인)             83
무직                                  76
주부 (전업주부, 파트타임 근무 주부)               45
생산/노무직 (생산감독, 경비원, 공장근로자)           43
기타                                  41
서비스직 (요식업, 숙박업, 미용실종업원)             39
교직 (교사, 유치원교사, 학원강사)                29
자영업 (도소매업, 숙박업, 미용업)                25
기능직 (자동차정비, 운전기사, 안경사, 택시기사)        19
판매직 (상점점원, 보험설계사, 노점상)              16
관리직 (사장, 간부, 고위공무원)                  9
농/축/광/수산업 (축산, 낙농업, 수산, 임업, 광업)      7
퇴직/연금생활자                             1
Name: 직업, dtype: int64

In [ ]:
drop_jobs = job_counts[job_counts.index.str.contains('학생|퇴직|주부')]
drop_jobs

학생 (초중고학생, 대학생, 대학원생)    164
주부 (전업주부, 파트타임 근무 주부)     45
퇴직/연금생활자                   1
Name: 직업, dtype: int64

In [ ]:
round((job_counts.sum() - drop_jobs.sum() - job_counts['무직']) / len(df5_23) * 100, 1),\
job_counts.sum() - drop_jobs.sum() - job_counts['무직']

(35.2, 590)

In [ ]:
job2_counts = df5_2['직업'].value_counts()
job3_counts = df5_3['직업'].value_counts()

In [ ]:
drop2_jobs = job2_counts[job2_counts.index.str.contains('학생|퇴직|주부')]
drop3_jobs = job3_counts[job3_counts.index.str.contains('학생|퇴직|주부')]
drop3_jobs

주부 (전업주부, 파트타임 근무 주부)    43
학생 (초중고학생, 대학생, 대학원생)    14
Name: 직업, dtype: int64

In [ ]:
round((job2_counts.sum() - drop2_jobs.sum() - job2_counts['무직']) / len(df5_23) * 100, 1),\
job2_counts.sum() - drop2_jobs.sum() - job2_counts['무직'],\
round((job3_counts.sum() - drop3_jobs.sum() - job3_counts['무직']) / len(df5_23) * 100, 1),\
job3_counts.sum() - drop3_jobs.sum() - job3_counts['무직']

(7.2, 121, 28.0, 469)

### 230대 자동차

In [ ]:
car_counts = df5_23['자동차'].value_counts()
car_counts

준중형차 (아반떼, K3, 크루즈, 제타급 등)          119
중형차 (쏘나타, K5, 말리부, 골프급 등)            77
준중형SUV (투싼, 스포티지, QM5, 티구안급 등)       42
경차 (모닝, 스파크 등)                       38
소형차 (액센트, 프라이드, 아베오, 피아트급 등)         31
준대형차 (그랜저, K7, 알페온, 캠리급, 파사트급 등)     27
중형SUV (싼타페, 쏘렌토, 캡티바, BMW X3급 등)     22
소형SUV/CUV (티볼리, QM3 등)               10
대형차 (제너시스, BMW5급 등)                   9
기타 (승합차/트럭/화물차/기타 차량 등)               6
MPV (카니발, 올란도, 피카소급, 오딧세이 등)          5
대형SUV (베라크루즈, 모하비, 투아렉급 등)            3
준중형파생 (벨로스터, I30 등)                   3
프리미엄 (에쿠스, BMW7급 등)                   1
Name: 자동차, dtype: int64

In [ ]:
round(car_counts.sum() / len(df5_23) * 100, 1),\
car_counts.sum()

(23.4, 393)

In [ ]:
car2_counts = df5_2['자동차'].value_counts()
car3_counts = df5_3['자동차'].value_counts()

round(car2_counts.sum() / len(df5_23) * 100, 1),\
car2_counts.sum(),\
round(car3_counts.sum() / len(df5_23) * 100, 1),\
car3_counts.sum()

(3.4, 57, 20.0, 336)

In [ ]:
df5_23['시도'].value_counts()[:5],\
df5_2['시도'].value_counts()[:5],\
df5_3['시도'].value_counts()[:5]

(서울    561
 경기    419
 인천    106
 부산     87
 대구     73
 Name: 시도, dtype: int64,
 서울    238
 경기    176
 인천     50
 부산     41
 경남     29
 Name: 시도, dtype: int64,
 서울    323
 경기    243
 인천     56
 부산     46
 대구     45
 Name: 시도, dtype: int64)

In [ ]:
df5_23[df5_23['시도'] == "서울"]['귀산촌'].value_counts()[:5],\
df5_2[df5_2['시도'] == "경기"]['귀산촌'].value_counts()[:5],\
df5_3[df5_3['시도'] == "서울"]['귀산촌'].value_counts()[:5]

(귀산촌    561
 Name: 귀산촌, dtype: int64,
 귀산촌    176
 Name: 귀산촌, dtype: int64,
 귀산촌    323
 Name: 귀산촌, dtype: int64)

In [ ]:
df5_45['시도'].value_counts()[:5],\
df5_45[df5_45['시도'] == "서울"]['귀산촌'].value_counts()[:5]

(서울    3743
 경기    3197
 인천     746
 부산     622
 대구     419
 Name: 시도, dtype: int64,
 귀산촌    3743
 Name: 귀산촌, dtype: int64)